tap "browsh-org/browsh"
tap "cmacrae/formulae"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "aichat"
brew "coreutils"
brew "eza"
brew "fd"
brew "feh"
brew "fzf"
brew "python@3.12"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lf"
brew "make"
brew "ncdu"
brew "neovim"
brew "node"
brew "ripgrep"
brew "rust"
brew "stow"
brew "tmux"
brew "tree"
brew "wget"
brew "browsh-org/browsh/browsh"
brew "cmacrae/formulae/spacebar"
brew "felixkratz/formulae/borders"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "alacritty"
cask "amethyst"
cask "firefox"
cask "font-awesome-terminal-fonts"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-fontawesome"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "gimp"
cask "hammerspoon"
cask "hyperkey"
cask "iterm2"
cask "keycastr"
cask "kitty"
cask "microsoft-edge"
cask "nextcloud"
cask "signal"
cask "spotify"
cask "uhk-agent"
cask "xquartz"
